tap homebrew/cask-fonts

brew 'aspell'
#brew 'chicken'
brew 'coreutils'
brew 'findutils'
brew 'gdbm'
brew 'git'
brew 'libyaml'
brew 'lua'
brew 'luarocks'
brew 'ncurses'
brew 'openssl'
brew 'pandoc'
brew 'pcre'
brew 'perl'
brew 'readline'
brew 'rg'
#brew 'sbcl'
brew 'xz'
#brew 'youtube-dl'
brew 'zsh'

brew 'ruby'
brew 'sqlite'

brew 'python'
#brew 'tmux'

brew 'ghostscript'
brew 'vim'

#cask 'alfred'
#cask 'dropbox'
cask 'emacs'
cask 'google-backup-and-sync'
cask 'google-chrome'
#cask 'hammerspoon'
#cask 'java'
#cask 'macvim'
#cask 'skim'

cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-gentium-plus"
cask "font-hasklig"
cask "font-ibm-plex"
cask "font-office-code-pro"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
