tap caskroom/cask
tap caskroom/fonts

brew 'aspell'
brew 'bash'
#brew 'chicken'
brew 'coreutils'
brew 'findutils'
#brew 'fribidi'
brew 'gdbm'
#brew 'gettext'
brew 'git'
#brew 'gmp'
brew 'graphite2'
#brew 'gsasl'
#brew 'icu4c'
brew 'jpeg'
#brew 'lame'
#brew 'libffi'
#brew 'libpng'
#brew 'libtasn1'
#brew 'libtool'
#brew 'libunistring'
#brew 'libvidstab'
#brew 'libvpx'
brew 'libyaml'
brew 'lua'
#brew 'nasm'
brew 'openssl'
brew 'pandoc'
#brew 'pcre'
brew 'perl'
#brew 'pkg-config'
brew 'readline'
brew 'rg'
#brew 'sbcl'
#brew 'xvid'
brew 'xz'
#brew 'youtube-dl'
brew 'zsh'

brew 'bash-completion@2'
#brew 'freetype'
#brew 'glib'
#brew 'libcaca'
#brew 'libevent'
brew 'libtiff'
#brew 'nettle'
#brew 'p11-kit'
#brew 'pixman'
brew 'ruby'
brew 'sqlite'
#brew 'texi2html'
#brew 'webp'
#brew 'x264'

#brew 'cairo'
#brew 'fontconfig'
#brew 'gdk-pixbuf'
#brew 'gnutls'
#brew 'libcroco'
brew 'little-cms2'
brew 'python'
#brew 'tmux'

brew 'ghostscript'
#brew 'harfbuzz'
#brew 'mailutils'
brew 'vim', args: ['with-lua', 'with-override-system-vi']

#brew 'pango'
#brew 'librsvg'

#brew 'ffmpeg', args: ['with-fontconfig', 'with-freetype', 'with-libcaca', 'with-librsvg', 'with-libvidstab', 'with-libvpx', 'with-webp', 'with-xz', 'without-qtkit']
#brew 'imagemagick@6', args: ['with-fontconfig', 'with-ghostscript', 'with-hdri', 'with-librsvg', 'with-little-cms2', 'with-pango', 'with-perl', 'with-webp']

#brew 'emacs', args: ['with-cocoa', 'with-ctags', 'with-imagemagick@6', 'with-librsvg', 'with-mailutils']

cask 'alfred'
cask 'dropbox'
cask 'emacs'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'hammerspoon'
cask 'java'
cask 'macvim'
cask 'skim'

cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-gentium-plus"
cask "font-hasklig"
cask "font-ibm-plex"
cask "font-office-code-pro"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-ubuntu"
