tap "homebrew/cask-fonts"
tap "d12frosted/emacs-plus"

brew 'aspell'
#brew 'chicken'
brew 'coreutils'
brew 'docbook'
brew 'findutils'
brew 'fribidi'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'gmp'
brew 'gnu-getopt'
brew 'graphite2'
brew 'icu4c'
brew 'ilmbase'
brew 'jpeg'
brew 'libde265'
brew 'libffi'
brew 'libomp'
brew 'libpng'
brew 'libtasn1'
brew 'libtool'
brew 'libunistring'
brew 'libyaml'
brew 'lua'
brew 'luarocks'
brew 'lzo'
brew 'ncurses'
brew 'openssl'
brew 'pandoc'
brew 'pcre'
brew 'pkg-config'
brew 'perl'
brew 'readline'
brew 'rg'
#brew 'sbcl'
brew 'x265'
brew 'xz'
#brew 'youtube-dl'
brew 'zsh'

brew 'docbook-xsl'
brew 'freetype'
brew 'libevent'
brew 'libidn2'
brew 'libtiff'
brew 'nettle'
brew 'openexr'
brew 'p11-kit'
brew 'pixman'
brew 'ruby'
brew 'sqlite'

brew 'fontconfig'
brew 'little-cms2'
brew 'python'
#brew 'tmux'
brew 'unbound'
brew 'webp'
brew 'xmlto'

brew 'ghostscript'
brew 'glib'
brew 'gnutls'
brew 'openjpeg'
brew 'shared-mime-info'
brew 'vim'

brew 'cairo'
brew 'gdk-pixbuf'
brew 'libheif'
brew 'liblqr'

brew 'harfbuzz'

brew 'pango'

brew 'imagemagick'
brew 'librsvg'

brew "emacs-plus@27", args: ["HEAD", "with-modern-sjrmanning-icon"]

#cask 'alfred'
#cask 'dropbox'
#cask 'emacs'
cask 'google-backup-and-sync'
cask 'google-chrome'
#cask 'hammerspoon'
#cask 'java'
#cask 'macvim'
#cask 'skim'

cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-gentium-plus"
cask "font-hasklig"
cask "font-ibm-plex"
cask "font-office-code-pro"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
